#pragma once
/* ------------------------------------------------------------------------- */
/* Log.h																	 */
/* ＲＯ３３																	 */
/* ログ情報を統括するクラス									 				 */
/*																			 */
/* ------------------------------------------------------------------------- */
/* 	番号	更新内容								更新日		名前		 */
/* ------------------------------------------------------------------------- */
/* 000000	新規作成								2018/06/22	桝井  隆治	 */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* includeファイル															 */
/* ------------------------------------------------------------------------- */
#include "common.h"

/* ------------------------------------------------------------------------- */
/* 定数定義																	 */
/* ------------------------------------------------------------------------- */

/* ログＩＤ一覧 ------------------------------------------------------------ */
#define LOG_ID_MOTOR		( 0x00000001 )		/* モーター関連				 */
#define LOG_ID_TAIL			( 0x00000002 )		/* しっぽ関連				 */
#define LOG_ID_SONIC		( 0x00000004 )		/* 超音波関連				 */
#define LOG_ID_BATTERY		( 0x00000008 )		/* バッテリー関連			 */
#define LOG_ID_COLOR		( 0x00000010 )		/* カラーセンサー関連		 */
#define LOG_ID_GYRO			( 0x00000020 )		/* ジャイロセンサー関連		 */
#define LOG_ID_TRACE		( 0x20000000 )		/* トレース関連				 */
#define LOG_ID_ERR			( 0x40000000 )		/* エラーログ				 */
#define LOG_ID_TERMINATE	( 0x80000000 )		/* 終端						 */

#define LOG_MAX_BUF			(        256 )		/* ログバッファ最大値		 */

/* ログコマンド一覧 -------------------------------------------------------- */
#define LOG_CMD_LOGON		"logon"				/* ログＯＮコマンド			 */
#define LOG_CMD_LOGOFF		"logoff"			/* 一部ログＯＦＦコマンド	 */
#define LOG_CMD_MOTOR		"motor"				/* モーター識別コード		 */
#define LOG_CMD_TAIL		"tail"				/* しっぽ識別コード			 */
#define LOG_CMD_GYRO		"gyro"				/* ジャイロ識別コード		 */
#define LOG_CMD_BATTERY		"battery"			/* バッテリー識別コード		 */
#define LOG_CMD_COLOR		"color"				/* カラーセンサー識別コード	 */
#define LOG_CMD_SONIC		"sonic"				/* 超音波センサー識別コード	 */
#define LOG_CMD_TRACE		"trace"				/* トレースログモード		 */

/* ------------------------------------------------------------------------- */
/* クラス定義																 */
/* ------------------------------------------------------------------------- */
class frLog{

public:
	frLog();
	frLog(SCHR* command);
	~frLog();
	void SetLog(SCHR code);
	void SetLog(SCHR* code);
	void LOG(SINT id, const SCHR* log, ...);

private:
	void CommandAnaryze( void );
	void FlgSet( const SINT flg, ULNG* log, SINT id );
	ULNG _logmode;
	SCHR _buf[LOG_MAX_BUF];
};



/* ------------------------------------------------------------------------- */
/*              Copyright HAL Collage of Technology & Design                 */
/* ------------------------------------------------------------------------- */



